<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({
    setup: () => {},
});
</script>

<template>
    <div>
        <h1 class="text-center">Settings for Company</h1>
        <ul>
            <li>Есть фото профиля</li>
            <li>Может менять личные данные</li>
            <li>Имя фирмы, адрес</li>
            <li>Будет блок со статистикой:</li>
            <li>Сколько сделанных услуг</li>
            <li>Сколько всего заработал за все время</li>
            <li>Сколько мастеров</li>
            <li>Кнопка для добавления новой услуги (модальное окно)</li>
            <li>пишет название услуги</li>
            <li>ее стоимость</li>
            <li>продолжительность</li>
            <li>
                Кнопка “Добавить нового работника” (Открывается модальное окно)
            </li>
            <li>
                Шаг 1. Сначала идет поиск мастера, которого хотят добавить (он
                должен быть зарегистрирован, чтобы он мог быть добавлен в фирму)
            </li>
            <li>
                Шаг 2. Потом он выбирает, какую услугу будет делать этот мастер.
            </li>
            <li>
                Шаг 3. Информация о том, что за человек добавляется и что он
                будет делать. Кнопка “подтвердить”
            </li>
        </ul>
    </div>
</template>

<style scoped></style>
